c1728p9/mbed/targets/TARGET_Freescale/usb/USBD_FS_MK64F.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2014 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        15. December 2014
 * $Revision:    V1.00
 *
 * Driver:       Driver_USBD0
 * Project:      USB Full/Low-Speed Device Driver for Freescale MK64F
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                Value
 *   ---------------------                -----
 *   Connect to hardware via Driver_USBD# = 0
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.00
 *    Initial release for USB Device CMSIS Driver API v2.01, with double buffer
 *    support
 */

/* Defines used for driver configuration:
 *
 *   USBH_MAX_ENDPOINT_NUM: defines maximum number of Pipes that driver will
 *                          support, this value impacts driver memory
 *                          requirements
 *     - default value is 15 (+ Default Pipe)
 *     - maximum value of this define is 31
 */


#include "mbed_toolchain.h"
#include "mbed_wait_api.h"

#if defined(TARGET_KSDK2_MCUS)
#include "fsl_common.h"
#endif

#include <stdint.h>
#include <string.h>
#include "cmsis_os.h"

#include "Driver_USBD.h"

#include "fsl_device_registers.h"

#define OTG_FS_USBD_DRIVER_INITIALIZED (1U      )
#define OTG_FS_USBD_DRIVER_POWERED     (1U << 1U)
#define OTG_FS_USBD_DRIVER_CONNECTED   (1U << 2U)

uint8_t otg_fs_role   = ARM_USB_ROLE_NONE;
uint8_t otg_fs_state  = 0;


// USB Device Driver ***********************************************************

#define ARM_USBD_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,0) // USBD driver version

// Driver Version
static const ARM_DRIVER_VERSION usbd_driver_version = { ARM_USBD_API_VERSION, ARM_USBD_DRV_VERSION };

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_driver_capabilities = {
  0U, // VBUS Detection
  0U, // Event VBUS On
  0U  // Event VBUS Off
};

// Maximum number of Endpoints (excluding Endpoint 0, maximum value is 15)
#ifndef USBD_MAX_ENDPOINT_NUM
#define USBD_MAX_ENDPOINT_NUM           15U
#endif
#if    (USBH_MAX_ENDPOINT_NUM > 15)
#error  Too many Endpoints, maximum Endpoints that this driver supports is 15 !!!
#endif

// Maximum packet size (in bytes) for any Endpoint (reducing this value can save
// RAM used for Endpoint data buffers, but it must be at least as big as largest
// Endpoint maximum packet size)
#ifndef USBD_EP_MAX_PACKET_SIZE
#define USBD_EP_MAX_PACKET_SIZE         64U
#endif

#define EP_NUM(ep_addr)                (ep_addr & ARM_USB_ENDPOINT_NUMBER_MASK)
#define EP_ID(ep_addr)                 (EP_NUM(ep_addr) * 2U + ((ep_addr >> 7U) & 1U))

#define BD_OWN_MASK                    (1U    << 7U)
#define BD_DATA01_MASK                 (1U    << 6U)
#define BD_KEEP_MASK                   (1U    << 5U)
#define BD_NINC_MASK                   (1U    << 4U)
#define BD_DTS_MASK                    (1U    << 3U)
#define BD_BDT_STALL_MASK              (1U    << 2U)
#define BD_TOK_PID_MASK                (0x0FU << 2U)
#define BD_TOK_PID(idx)                ((BD[idx].stat & BD_TOK_PID_MASK) >> 2U)
#define BD_IDX(endp, tx, odd)          (((endp & 0x0FU) * 4U) + tx * 2U + odd)
#define BD_ID(ep_addr)                 (EP_NUM(ep_addr) * 4U + ((ep_addr >> 7U) & 1U) * 2U)
#define EP_ID_FROM_NUM(endp,tx)        (endp * 2U + tx)
#define BD_ID_FROM_NUM(endp,tx,odd)    (endp * 4U + tx * 2U + odd)

#define TOK_PID_SETUP                   0x0DU
#define TOK_PID_IN                      0x09U
#define TOK_PID_OUT                     0x01U

typedef struct _BD_t {                                  // Buffer Descriptor table entry
  uint32_t  cmd_stat;
  uint32_t  buf_addr;
} BD_t;

typedef struct _ENDPOINT_t {                            // Endpoint runtime information structure
  uint16_t  ep_max_packet_size;
  uint8_t   active;
  uint8_t  *data;
  uint32_t  num;
  uint32_t  num_transferred_total;
  uint16_t  num_transferring[2];
  uint8_t   next_data_toggle;
  uint8_t   last_bd_odd;
  uint8_t   next_bd_odd;
} ENDPOINT_t;

// Local variables and structures
static ARM_USBD_SignalDeviceEvent_t   SignalDeviceEvent;
static ARM_USBD_SignalEndpointEvent_t SignalEndpointEvent;

static ARM_USBD_STATE      usbd_device_state = { 0U };  // Device state

static uint32_t            setup_packet[2]   = { 0U };  // Setup packet data
static volatile uint8_t    setup_received    =   0U;    // Setup packet received
static volatile uint32_t   configured_ep;               // Bit mask of configured Endpoints

// Buffer Descriptor Table
static BD_t MBED_ALIGN(512)   bd          [(USBD_MAX_ENDPOINT_NUM+1U)*2U*2U];

// Endpoints IN data buffers
static uint32_t            ep_in_data  [(USBD_MAX_ENDPOINT_NUM+1U)][2U][USBD_EP_MAX_PACKET_SIZE/4U] = { 0U };

// Endpoints runtime information
static volatile ENDPOINT_t ep          [(USBD_MAX_ENDPOINT_NUM+1U)*2U];


// Function prototypes
static uint16_t  USBD_GetFrameNumber (void);


// Local functions

/**
  \fn          void USBD_HW_Initialize (void)
  \brief       Initialize USB controller.
*/
static void USBD_HW_Initialize (void) {
  uint8_t i;

