c1728p9/mbed/targets/TARGET_Freescale/usb/USBD_FS_MK64F.c
  USB0->USBTRC0      |=  USB_USBTRC0_USBRESET_MASK;     // Reset OTG FS Controller
  wait_ms(1);                                           // wait for reset to finish

#if defined(TARGET_KL43Z) || defined(TARGET_K22F) || defined(TARGET_K64F)
  // enable USBFS clock
  CLOCK_EnableUsbfs0Clock(kCLOCK_UsbSrcIrc48M, 48000000U);
#endif

  USB0->CTL          &= ~USB_CTL_USBENSOFEN_MASK;       // Disable USB
  USB0->CTL          |=  USB_CTL_USBENSOFEN_MASK;       // Enable USB
  USB0->CTL          &= ~USB_CTL_HOSTMODEEN_MASK;       // Force Device mode
  USB0->CTL          |=  USB_CTL_ODDRST_MASK;           // Reset buffer descriptor table entry to EVEN
  USB0->CTL          &= ~USB_CTL_ODDRST_MASK;           // Clear buffer descriptor table entry reset

  USB0->USBCTRL       =  0U;                            // Reset USB CTRL register
  USB0->USBCTRL      &= ~USB_USBCTRL_SUSP_MASK;         // USB transceiver resume

  USB0->BDTPAGE1      = ((uint32_t)(bd) >>  8U) & 0xFEU;// Set BDT address
  USB0->BDTPAGE2      = ((uint32_t)(bd) >> 16U);
  USB0->BDTPAGE3      = ((uint32_t)(bd) >> 24U);

  for (i = 0U; i < 16U; i++) {                          // Clear all Endpoint Control registers
    USB0->ENDPOINT[i].ENDPT = 0U;
  }

  USB0->ADDR          =  0U;                            // Clear ADDR

  USB0->ERRSTAT       =  0xFFU;                         // Clear all error interrupts
  USB0->ERREN        |=  USB_ERREN_BTSERREN_MASK |      // Enable all error interrupts
                         USB_ERREN_DMAERREN_MASK |
                         USB_ERREN_BTOERREN_MASK |
                         USB_ERREN_DFN8EN_MASK   |
                         USB_ERREN_CRC16EN_MASK  |
                         USB_ERREN_CRC5EOFEN_MASK|
                         USB_ERREN_PIDERREN_MASK ;
  USB0->ISTAT         =  0xFFU;                         // Clear interrupt flags
  USB0->INTEN         =  USB_INTEN_USBRSTEN_MASK ;      // Enable USBRST interrupt
}

/**
  \fn          void USBD_HW_Reset (void)
  \brief       USB Bus Reset.
*/
static void USBD_Reset (void) {
  volatile ENDPOINT_t *ptr_ep;
  volatile BD_t       *ptr_bd;
  uint8_t              i;

  memset((void *)ep, 0, sizeof(ep));                    // Clear all Endpoints runtime information

  ptr_ep  = &ep[0];                                     // Initialize all starting odd bits
  for (i = 0U; i < USBD_MAX_ENDPOINT_NUM; i++) {
    ptr_ep->last_bd_odd = 1U; ptr_ep++;
    ptr_ep->last_bd_odd = 1U; ptr_ep++;
  }

  memset((void *)bd, 0, sizeof(bd));                    // Clear Buffer Descriptor Table

  ptr_ep  = &ep[0];
  ptr_ep->next_bd_odd = 1U;                             // Set next_bd_odd to odd for next transfer
  ptr_bd  = &bd[0];                                     // Setup Endpoint 0 OUT EVEN Buffer Descriptor Table (BDT) entry
  ptr_bd->buf_addr    = (uint32_t)setup_packet;
  ptr_bd->cmd_stat    = (8U << 16U) | BD_OWN_MASK | BD_DTS_MASK | BD_DATA01_MASK;
  ptr_bd += 2U;                                         // Skip Endpoint 0 OUT ODD BDT entry
                                                        // Set all initial Endpoints IN data sizes and buffer addresses
  for (i=0U; i<USBD_MAX_ENDPOINT_NUM; i++) {
                                                        // Endpoint IN EVEN BDT entry
    ptr_bd->buf_addr  = (uint32_t)(&ep_in_data[i][0][0]);
    ptr_bd->cmd_stat |= (USBD_EP_MAX_PACKET_SIZE << 16U);
    ptr_bd++;
                                                        // Endpoint IN ODD  BDT entry
    ptr_bd->buf_addr  = (uint32_t)(&ep_in_data[i][1][0]);
    ptr_bd->cmd_stat |= (USBD_EP_MAX_PACKET_SIZE << 16U);

    ptr_bd           += 3U;                             // Skip Endpoint OUT BDT entries
    // OUT Endpoints directly use provided RAM buffers except inital OUT for setup packet
  }
  configured_ep       = 1U;                             // Endpoint 0 OUT is configured to receive first SETUP packet

  USB0->ENDPOINT[0].ENDPT = USB_ENDPT_EPHSHK_MASK |     // Enable Endpoint handshaking
                            USB_ENDPT_EPRXEN_MASK ;     // Enable RX (OUT or SETUP) transfer

  USB0->CTL          |=  USB_CTL_ODDRST_MASK;           // Reset buffer descriptor table entry to EVEN
  USB0->CTL          &= ~USB_CTL_ODDRST_MASK;           // Clear buffer descriptor table entry reset

  USB0->ADDR          =  0U;                            // Clear ADDR

  USB0->ERRSTAT       =  0xFFU;                         // Clear all error interrupts
  USB0->ERREN        |=  USB_ERREN_BTSERREN_MASK |      // Enable all error interrupts
                         USB_ERREN_DMAERREN_MASK |
                         USB_ERREN_BTOERREN_MASK |
                         USB_ERREN_DFN8EN_MASK   |
                         USB_ERREN_CRC16EN_MASK  |
                         USB_ERREN_CRC5EOFEN_MASK|
                         USB_ERREN_PIDERREN_MASK ;
  USB0->ISTAT         =  0xFFU;                         // Clear interrupt flags
  USB0->INTEN         =  USB_ISTAT_STALL_MASK    |      // Enable STALL interrupt
                         USB_INTEN_SLEEPEN_MASK  |      // Enable SLEEP interrupt
                         USB_INTEN_TOKDNEEN_MASK |      // Enable TOKDNE interrupt
                         USB_INTEN_ERROREN_MASK  |      // Enable ERROR interrupt
                         USB_INTEN_USBRSTEN_MASK ;      // Enable USBRST interrupt
}

/**
  \fn          void USBD_HW_EndpointTransfer (uint8_t endp,
                                              uint8_t tx)
  \brief       Start transfer on Endpoint.
  \param[in]   endp:    Endpoint Number
  \param[in]   tx       Transmit or receive direction
                - value 0: Receive
                - value 1: Transmit
*/
static void USBD_HW_EndpointTransfer (uint8_t endp, uint8_t tx) {
  volatile ENDPOINT_t *ptr_ep;
  volatile BD_t       *ptr_bd;
  uint8_t             *data_addr;
  uint32_t             data_num, num_to_transfer;
  uint8_t              next_bd_odd, next_data_toggle;

  ptr_ep           = &ep[EP_ID_FROM_NUM(endp,tx)];
  next_bd_odd      =  ptr_ep->next_bd_odd;
  ptr_bd           = &bd[BD_ID_FROM_NUM(endp,tx,next_bd_odd)]; if (ptr_bd->cmd_stat & BD_OWN_MASK) return;
  data_addr        = (uint8_t *)(ptr_ep->data + ptr_ep->num_transferred_total + ptr_ep->num_transferring[!next_bd_odd]);
  data_num         =  ptr_ep->num - ptr_ep->num_transferred_total - ptr_ep->num_transferring[!next_bd_odd];
  next_data_toggle =  ptr_ep->next_data_toggle;

  if (data_num > ptr_ep->ep_max_packet_size) {
    num_to_transfer = ptr_ep->ep_max_packet_size;
  } else {
    num_to_transfer = data_num;
  }
  ptr_ep->num_transferring[next_bd_odd] = num_to_transfer;
  ptr_ep->next_data_toggle ^= 1U;
  ptr_ep->next_bd_odd      ^= 1U;

  if (tx) {                             // Endpoint IN
                                        // Copy data to RAM buffer to be sent
    memcpy(&ep_in_data[endp][next_bd_odd][0], data_addr, num_to_transfer);
  } else {                              // Endpoint OUT
                                        // Set address where data should be received
    ptr_bd->buf_addr = (uint32_t)data_addr;
  }
  ptr_bd->cmd_stat   = (num_to_transfer << 16U) | BD_OWN_MASK | BD_DTS_MASK | (BD_DATA01_MASK * next_data_toggle);
}


