c1728p9/mbed/targets/TARGET_Freescale/usb/USBD_FS_MK64F.c
// USB Device Driver functions

/**
  \fn          ARM_DRIVER_VERSION USBD_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBD_GetVersion (void) { return usbd_driver_version; }

/**
  \fn          ARM_USBD_CAPABILITIES USBD_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_USBD_CAPABILITIES
*/
static ARM_USBD_CAPABILITIES USBD_GetCapabilities (void) { return usbd_driver_capabilities; }

/**
  \fn          int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                        ARM_USBD_SignalEndpointEvent_t cb_endpoint_event)
  \brief       Initialize USB Device Interface.
  \param[in]   cb_device_event    Pointer to \ref ARM_USBD_SignalDeviceEvent
  \param[in]   cb_endpoint_event  Pointer to \ref ARM_USBD_SignalEndpointEvent
  \return      \ref execution_status
*/
static int32_t USBD_Initialize (ARM_USBD_SignalDeviceEvent_t   cb_device_event,
                                ARM_USBD_SignalEndpointEvent_t cb_endpoint_event) {

  if (otg_fs_state & OTG_FS_USBD_DRIVER_INITIALIZED) { return ARM_DRIVER_OK;    }
  if (otg_fs_state)                                  { return ARM_DRIVER_ERROR; }

  SignalDeviceEvent   = cb_device_event;
  SignalEndpointEvent = cb_endpoint_event;

  MPU->CESR=0;                          // Disable MPU

  otg_fs_role   =  ARM_USB_ROLE_DEVICE;
  otg_fs_state |=  OTG_FS_USBD_DRIVER_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_Uninitialize (void)
  \brief       De-initialize USB Device Interface.
  \return      \ref execution_status
*/
static int32_t USBD_Uninitialize (void) {

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_INITIALIZED)) { return ARM_DRIVER_OK;    }
  if (  otg_fs_state & OTG_FS_USBD_DRIVER_POWERED     ) { return ARM_DRIVER_ERROR; }

  otg_fs_role   =  ARM_USB_ROLE_NONE;
  otg_fs_state &= ~OTG_FS_USBD_DRIVER_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_PowerControl (ARM_POWER_STATE state)
  \brief       Control USB Device Interface Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t USBD_PowerControl (ARM_POWER_STATE state) {

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_INITIALIZED)) { return ARM_DRIVER_ERROR; }

  switch (state) {
    case ARM_POWER_OFF:
      if (!(otg_fs_state & OTG_FS_USBD_DRIVER_POWERED)) { return ARM_DRIVER_OK; }
      otg_fs_state  &= ~OTG_FS_USBD_DRIVER_POWERED;
      NVIC_DisableIRQ(USB0_IRQn);                       // Disable interrupt
      USB0->USBCTRL |=  USB_USBCTRL_SUSP_MASK;          // Suspend USB transceiver
      USB0->CTL     &= ~USB_CTL_USBENSOFEN_MASK;        // Disable USB
      SIM->SCGC4    &= ~SIM_SCGC4_USBOTG_MASK;          // Disable OTG FS Clock
      usbd_device_state.vbus   = 0U;                    // USB Device no VBUS
      usbd_device_state.speed  = 0U;                    // USB Device speed (low)
      usbd_device_state.active = 0U;                    // USB Device not active
      break;

    case ARM_POWER_FULL:
      if (  otg_fs_state & OTG_FS_USBD_DRIVER_POWERED ) { return ARM_DRIVER_OK; }

      // Enable all clocks needed for USB to function, set USB clock to 48 MHz
      SIM->SOPT2    |=  SIM_SOPT2_USBSRC_MASK;          // MCGFLLCLK, MCGPLLCLK, or IRC48M used as src
      SIM->SCGC4    |=  SIM_SCGC4_USBOTG_MASK;          // Enable OTG FS Clock

      USBD_HW_Initialize();                             // Initialize USB controller

      otg_fs_state  |=  OTG_FS_USBD_DRIVER_POWERED;

      NVIC_ClearPendingIRQ(USB0_IRQn);                  // Clear interrupt
      NVIC_EnableIRQ(USB0_IRQn);                        // Enable interrupt
      break;

    default:
      return ARM_DRIVER_ERROR_UNSUPPORTED;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceConnect (void)
  \brief       Connect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceConnect (void) {

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_POWERED) ) { return ARM_DRIVER_ERROR; }
  if (  otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED) { return ARM_DRIVER_OK;    }

  usbd_device_state.speed  =  ARM_USB_SPEED_FULL;
  usbd_device_state.active =  true;

  USB0->CONTROL     =  USB_CONTROL_DPPULLUPNONOTG_MASK; // Activate pull-up on D+

  otg_fs_state     |=  OTG_FS_USBD_DRIVER_CONNECTED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceDisconnect (void)
  \brief       Disconnect USB Device.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceDisconnect (void) {

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_POWERED)  ) { return ARM_DRIVER_ERROR; }
  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_OK;    }

  USB0->CONTROL     =  0U;                              // De-activate pull-up on D+

  usbd_device_state.active =  false;

  otg_fs_state     &= ~OTG_FS_USBD_DRIVER_CONNECTED;

  return ARM_DRIVER_OK;
}

/**
  \fn          ARM_USBD_STATE USBD_DeviceGetState (void)
  \brief       Get current USB Device State.
  \return      Device State \ref ARM_USBD_STATE
*/
static ARM_USBD_STATE USBD_DeviceGetState (void) {
  return usbd_device_state;
}

/**
  \fn          int32_t USBD_DeviceRemoteWakeup (void)
  \brief       Trigger USB Remote Wakeup.
  \return      \ref execution_status
*/
static int32_t USBD_DeviceRemoteWakeup (void) {

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR; }

  USB0->CTL |=  USB_CTL_RESUME_MASK;
  wait_ms(5);
  USB0->CTL &= ~USB_CTL_RESUME_MASK;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_DeviceSetAddress (uint8_t dev_addr)
  \brief       Set USB Device Address.
  \param[in]   dev_addr  Device Address
  \return      \ref execution_status
*/
static int32_t USBD_DeviceSetAddress (uint8_t dev_addr) {

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR; }

  USB0->ADDR = dev_addr & 0x7FU;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_ReadSetupPacket (uint8_t *setup)
  \brief       Read setup packet received over Control Endpoint.
  \param[out]  setup  Pointer to buffer for setup packet
  \return      \ref execution_status
*/
static int32_t USBD_ReadSetupPacket (uint8_t *setup) {

