c1728p9/mbed/targets/TARGET_Freescale/usb/USBD_FS_MK64F.c
  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR; }
  if (!setup_received)                                { return ARM_DRIVER_ERROR; }

  setup_received = 0U;
  memcpy(setup, setup_packet, 8);

  if (setup_received) {
    return ARM_DRIVER_ERROR;            // New setup packet was received while this was being read
  }

  USB0->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointConfigure (uint8_t  ep_addr,
                                               uint8_t  ep_type,
                                               uint16_t ep_max_packet_size)
  \brief       Configure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type  Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \return      \ref execution_status
*/
static int32_t USBD_EndpointConfigure (uint8_t  ep_addr,
                                       uint8_t  ep_type,
                                       uint16_t ep_max_packet_size) {
  volatile ENDPOINT_t *ptr_ep;
  uint32_t             ep_num, ep_dir, ep_msk, ep_mps;

  ptr_ep = &ep[EP_ID(ep_addr)];
  ep_num =  EP_NUM(ep_addr);
  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;
  ep_msk = (1U << ep_num) << (16U * ep_dir);
  ep_mps =  ep_max_packet_size & ARM_USB_ENDPOINT_MAX_PACKET_SIZE_MASK;

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR;      }
  if (ptr_ep->active)                                 { return ARM_DRIVER_ERROR_BUSY; }
  if (ep_num > USBD_MAX_ENDPOINT_NUM)                 { return ARM_DRIVER_ERROR;      }

  // Store maximum packet size of Endpoint
  ptr_ep->ep_max_packet_size    = ep_mps;

  // Clear current transfer information
  ptr_ep->active                = 0U;
  ptr_ep->data                  = NULL;
  ptr_ep->num                   = 0U;
  ptr_ep->num_transferred_total = 0U;
  ptr_ep->num_transferring[0]   = 0U;
  ptr_ep->num_transferring[1]   = 0U;
  ptr_ep->next_data_toggle      = 0U;

  configured_ep |=  ep_msk;             // Set flag in configured_ep for Endpoint we have configured

  USB0->ENDPOINT[ep_num].ENDPT |= USB_ENDPT_EPHSHK_MASK             |   // Enable Endpoint handshaking
                                  USB_ENDPT_EPRXEN_MASK * (!ep_dir) |   // Enable RX if OUT Endpoint
                                  USB_ENDPT_EPTXEN_MASK *   ep_dir;     // Enable TX if IN  Endpoint

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointUnconfigure (uint8_t ep_addr)
  \brief       Unconfigure USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointUnconfigure (uint8_t ep_addr) {
  volatile ENDPOINT_t *ptr_ep;
  volatile BD_t       *ptr_bd;
  uint32_t             ep_num, ep_dir, ep_msk;

  ptr_ep = &ep[EP_ID(ep_addr)];
  ep_num =  EP_NUM(ep_addr);
  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;
  ep_msk = (1U << ep_num) << (16U * ep_dir);

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR;      }
  if (ptr_ep->active)                                 { return ARM_DRIVER_ERROR_BUSY; }
  if (!(configured_ep & ep_msk))                      { return ARM_DRIVER_OK;         }
  if (ep_num > USBD_MAX_ENDPOINT_NUM)                 { return ARM_DRIVER_ERROR;      }

  ep_num =  EP_NUM(ep_addr);
  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;

  USB0->ENDPOINT[ep_num].ENDPT &= ~(USB_ENDPT_EPRXEN_MASK * (!ep_dir) | // Disable RX if OUT Endpoint
                                    USB_ENDPT_EPTXEN_MASK *   ep_dir) ; // Disable TX if IN  Endpoint

  configured_ep &= ~ep_msk;             // Clear flag in configured_ep for Endpoint we have unconfigured

  ptr_bd           = &bd[BD_ID(ep_addr)];
  ptr_bd->cmd_stat = 0U; ptr_bd++;      // Clear corresponding EVEN BDT entry
  ptr_bd->cmd_stat = 0U;                // Clear corresponding ODD  BDT entry

  // Clear Endpoint runtime information (leave last_bd_odd)
  ptr_ep->ep_max_packet_size    = 0U;
  ptr_ep->data                  = NULL;
  ptr_ep->num                   = 0U;
  ptr_ep->num_transferred_total = 0U;
  ptr_ep->num_transferring[0]   = 0U;
  ptr_ep->num_transferring[1]   = 0U;
  ptr_ep->next_data_toggle      = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointStall (uint8_t ep_addr, bool stall)
  \brief       Set/Clear Stall for USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   stall  Operation
                - \b false Clear
                - \b true Set
  \return      \ref execution_status
*/
static int32_t USBD_EndpointStall (uint8_t ep_addr, bool stall) {
  volatile ENDPOINT_t *ptr_ep;
  volatile BD_t       *ptr_bd;
  uint32_t             ep_num, ep_dir, ep_msk;

  ptr_ep = &ep[EP_ID(ep_addr)];
  ep_num =  EP_NUM(ep_addr);
  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;
  ep_msk = (1U << ep_num) << (16U * ep_dir);

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR;      }
  if (ptr_ep->active)                                 { return ARM_DRIVER_ERROR_BUSY; }
  if (!(configured_ep & ep_msk))                      { return ARM_DRIVER_ERROR;      }
  if (ep_num > USBD_MAX_ENDPOINT_NUM)                 { return ARM_DRIVER_ERROR;      }

  if (stall) {                          // Activate STALL
    USB0->ENDPOINT[ep_num].ENDPT |=  USB_ENDPT_EPSTALL_MASK;
  } else {                              // Clear STALL
    ptr_ep->next_data_toggle = 0U;      // Clear data toggle bit

    ptr_bd           = &bd[BD_ID(ep_addr)];
    ptr_bd->cmd_stat = 0U; ptr_bd++;    // Clear corresponding EVEN BDT entry
    ptr_bd->cmd_stat = 0U;              // Clear corresponding ODD  BDT entry

    USB0->ENDPOINT[ep_num].ENDPT &= ~USB_ENDPT_EPSTALL_MASK;
  }

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USBD_EndpointTransfer (uint8_t ep_addr, uint8_t *data, uint32_t num)
  \brief       Read data from or Write data to USB Endpoint.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[out]  data Pointer to buffer for data to read or with data to write
  \param[in]   num  Number of data bytes to transfer
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransfer (uint8_t ep_addr, uint8_t *data, uint32_t num) {
  volatile ENDPOINT_t *ptr_ep;
  uint32_t             ep_num, ep_dir, ep_msk;

