c1728p9/mbed/targets/TARGET_Freescale/usb/USBD_FS_MK64F.c
  ptr_ep = &ep[EP_ID(ep_addr)];
  ep_num =  EP_NUM(ep_addr);
  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;
  ep_msk = (1U << ep_num) << (16U * ep_dir);

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR;      }
  if (ptr_ep->active)                                 { return ARM_DRIVER_ERROR_BUSY; }
  if (!(configured_ep & ep_msk))                      { return ARM_DRIVER_ERROR;      }
  if (ep_num > USBD_MAX_ENDPOINT_NUM)                 { return ARM_DRIVER_ERROR;      }

  ptr_ep->active                = 1U;
  ptr_ep->data                  = data;
  ptr_ep->num                   = num;
  ptr_ep->num_transferred_total = 0U;
  ptr_ep->num_transferring[0]   = 0U;
  ptr_ep->num_transferring[1]   = 0U;
  ptr_ep->next_bd_odd           = ptr_ep->last_bd_odd ^ 1U;     // Set next odd bit

  USBD_HW_EndpointTransfer(ep_num, ep_dir);             // Start the transaction

  return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t USBD_EndpointTransferGetResult (uint8_t ep_addr)
  \brief       Get result of USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      number of successfully transferred data bytes
*/
static uint32_t USBD_EndpointTransferGetResult (uint8_t ep_addr) {

  if (EP_NUM(ep_addr) > USBD_MAX_ENDPOINT_NUM) { return 0U; }

  return (ep[EP_ID(ep_addr)].num_transferred_total);
}

/**
  \fn          int32_t USBD_EndpointTransferAbort (uint8_t ep_addr)
  \brief       Abort current USB Endpoint transfer.
  \param[in]   ep_addr  Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \return      \ref execution_status
*/
static int32_t USBD_EndpointTransferAbort (uint8_t ep_addr) {
  volatile ENDPOINT_t *ptr_ep;
  volatile BD_t       *ptr_bd;
  uint32_t             ep_num, ep_dir, ep_msk;

  ptr_ep = &ep[EP_ID(ep_addr)];
  ep_num =  EP_NUM(ep_addr);
  ep_dir = (ep_addr & ARM_USB_ENDPOINT_DIRECTION_MASK) == ARM_USB_ENDPOINT_DIRECTION_MASK;
  ep_msk = (1U << ep_num) << (16U * ep_dir);

  if (!(otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED)) { return ARM_DRIVER_ERROR; }
  if (!(configured_ep & ep_msk))                      { return ARM_DRIVER_ERROR; }
  if (ep_num > USBD_MAX_ENDPOINT_NUM)                 { return ARM_DRIVER_ERROR; }

  ptr_ep->num                   = 0U;
  ptr_ep->num_transferred_total = 0U;
  ptr_ep->num_transferring[0]   = 0U;
  ptr_ep->num_transferring[1]   = 0U;
  ptr_ep->next_data_toggle      = 0U;

  ptr_bd           = &bd[BD_ID(ep_addr)];
  ptr_bd->cmd_stat =  0U; ptr_bd++;     // Clear corresponding EVEN BDT entry
  ptr_bd->cmd_stat =  0U;               // Clear corresponding ODD  BDT entry

  ptr_ep->active                = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          uint16_t USBD_GetFrameNumber (void)
  \brief       Get current USB Frame Number.
  \return      Frame Number
*/
static uint16_t USBD_GetFrameNumber (void) {
  return ((((uint32_t)(USB0->FRMNUML)) | (((uint32_t)(USB0->FRMNUMH)) << 8)) & 0x07FFU);
}

/**
  \fn          void USBD_FS_IRQ (void)
  \brief       USB0 Device Interrupt Routine (IRQ).
*/
void USBD_FS_IRQ (void) {
  volatile ENDPOINT_t *ptr_ep;
  volatile BD_t       *ptr_bd;
  uint32_t             istat, stat, errstat;
  uint8_t              endp, tx, odd, token, en_setup;

  istat   = USB0->ISTAT & USB0->INTEN;                  // Read active interrupts
  stat    = USB0->STAT;
  errstat = USB0->ERRSTAT;
  USB0->ISTAT = istat;                                  // Clear interrupts

  en_setup = 0;

  if (istat & USB_ISTAT_USBRST_MASK) {                  // Reset interrupt
    if (otg_fs_state & OTG_FS_USBD_DRIVER_CONNECTED) {
      USBD_Reset();                                     // USB Bus Reset
      SignalDeviceEvent(ARM_USBD_EVENT_RESET);
    }
  }

  if (istat & USB_ISTAT_SLEEP_MASK) {                   // Suspend interrupt
    usbd_device_state.active = false;
    SignalDeviceEvent(ARM_USBD_EVENT_SUSPEND);
  }

  if (istat & USB_ISTAT_RESUME_MASK) {                  // Resume interrupt
    usbd_device_state.active = true;
    SignalDeviceEvent(ARM_USBD_EVENT_RESUME);
  }

  if (istat & USB_ISTAT_ERROR_MASK) {                   // Error interrupt
    USB0->ERRSTAT = errstat;                            // Clear all errors
  }

  if (istat & USB_ISTAT_STALL_MASK) {                   // Stall interrupt
    if (USB0->ENDPOINT[0].ENDPT & USB_ENDPT_EPSTALL_MASK) {
      USB0->ENDPOINT[0].ENDPT &= ~USB_ENDPT_EPSTALL_MASK;
      en_setup = 1U;                    // Enable reception of new SETUP Packet
    }
  }

  if (istat & USB_ISTAT_TOKDNE_MASK) {                  // Token interrupt
    endp     = (stat >> 4U) & 0x0FU;
    tx       = (stat >> 3U) & 0x01U;
    odd      = (stat >> 2U) & 0x01U;
    ptr_ep   = &ep[EP_ID_FROM_NUM(endp,tx)];
    ptr_bd   = &bd[BD_ID_FROM_NUM(endp,tx,odd)];
    ptr_ep->last_bd_odd = odd;
    token    = ((ptr_bd->cmd_stat >> 2U) & 0x0FU);
    switch (token) {
      case TOK_PID_SETUP:               // SETUP packet
        ptr_bd           = bd;          // Disable all BDT entries for Endpoint 0
        ptr_bd->cmd_stat = 0U; ptr_bd++;
        ptr_bd->cmd_stat = 0U; ptr_bd++;
        ptr_bd->cmd_stat = 0U; ptr_bd++;
        ptr_bd->cmd_stat = 0U;

        ep[0].next_data_toggle = 1U;    // Next OUT packet should be DATA1
        ep[1].next_data_toggle = 1U;    // Next IN  packet should be DATA1

        setup_received = 1U;            // Set SETUP packet pending
        SignalEndpointEvent(0, ARM_USBD_EVENT_SETUP);
        break;

      case TOK_PID_OUT:                 // OUT packet
        ptr_ep->num_transferred_total += (ptr_bd->cmd_stat >> 16U) & 0x3FFU;
        ptr_ep->num_transferring[odd]  =  0U;
        if (!endp && !ptr_ep->num && (setup_packet[0] & 0x80U)) {
           en_setup = 1U;               // If OUT ZLP (Device-to-Host request) enable reception of new SETUP Packet
        }
        if ((ptr_ep->num_transferred_total % ptr_ep->ep_max_packet_size) || (ptr_ep->num == ptr_ep->num_transferred_total)){
          // If all OUT data was received (required size or data terminated with ZLP or short packet), set ARM_USBD_EP_EVENT_OUT
          ptr_ep->active = 0U;          // Clear Endpoint busy flag
          SignalEndpointEvent((tx << 7U) | endp, ARM_USBD_EVENT_OUT);       // Send OUT event
        } else {
          // If this is not last transfer, enable next
          if ((ptr_ep->num > (ptr_ep->num_transferred_total + ptr_ep->num_transferring[!odd])) && (!ptr_ep->num_transferring[!odd])) {
            // If alternate BDT entry is empty and there is data to transfer, activate it
            USBD_HW_EndpointTransfer (endp, tx);
          }
          if (ptr_ep->num > (ptr_ep->num_transferred_total + ptr_ep->num_transferring[!odd])) {
            // If there is data to transfer activate it on current BDT entry
            USBD_HW_EndpointTransfer (endp, tx);
          }
        }
        break;

      case TOK_PID_IN:                  // IN Packet
        ptr_ep->num_transferred_total += ptr_ep->num_transferring[odd];
        ptr_ep->num_transferring[odd]  = 0U;
        if (!endp && !ptr_ep->num && !(setup_packet[0] & 0x80U)) {
          en_setup = 1U;                // If IN ZLP (Host-to-Device request) enable reception of new SETUP Packet
        }
        if (ptr_ep->num == ptr_ep->num_transferred_total) {
          // If all required IN data was sent, set ARM_USBD_EP_EVENT_IN
          ptr_ep->active = 0U;          // Clear Endpoint busy flag
          SignalEndpointEvent((tx << 7U) | endp, ARM_USBD_EVENT_IN);        // Send IN event
        } else {
          // If this is not last transfer, enable next
          if ((ptr_ep->num > (ptr_ep->num_transferred_total + ptr_ep->num_transferring[!odd])) && (!ptr_ep->num_transferring[!odd])) {
            // If alternate BDT entry is empty and there is data to transfer, activate it
            USBD_HW_EndpointTransfer (endp, tx);
          }
          if (ptr_ep->num > (ptr_ep->num_transferred_total + ptr_ep->num_transferring[!odd])) {
            // If there is data to transfer activate it on current BDT entry
            USBD_HW_EndpointTransfer (endp, tx);
          }
        }
        break;
    }
  }
  if (en_setup) {                       // If SETUP is expected, enable it's reception
    ptr_ep  = &ep[0];
    odd     =  ptr_ep->last_bd_odd ^ 1U;// Next is alternate of last
    ptr_bd  = &bd[odd];                 // Endpoint 0 OUT Buffer Descriptor Table (BDT) entry
    // Enable reception of SETUP Packet or OUT ZLP (DATA1)
    ptr_bd->buf_addr = (uint32_t)setup_packet;
    ptr_bd->cmd_stat = (8U << 16U) | BD_OWN_MASK | BD_DTS_MASK;
  }
}


ARM_DRIVER_USBD Driver_USBD0 = {
  USBD_GetVersion,
  USBD_GetCapabilities,
  USBD_Initialize,
  USBD_Uninitialize,
  USBD_PowerControl,
  USBD_DeviceConnect,
  USBD_DeviceDisconnect,
  USBD_DeviceGetState,
  USBD_DeviceRemoteWakeup,
  USBD_DeviceSetAddress,
  USBD_ReadSetupPacket,
  USBD_EndpointConfigure,
  USBD_EndpointUnconfigure,
  USBD_EndpointStall,
  USBD_EndpointTransfer,
  USBD_EndpointTransferGetResult,
  USBD_EndpointTransferAbort,
  USBD_GetFrameNumber
};
